Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В визуализаторе «Отчет по регрессии» для линейной и логистической регрессий добавлен вывод числа степеней свободы модели, а для логистической регрессии — вывод Deviance нулевой модели.
en: Output of degrees of freedom for model was added in the "Regression Report" visualizer for the linear and logistic regressions, and output of the Deviance null model was added in the the logistic regression.

source: В выходном наборе «Дополнительные данные» добавлен столбец, содержащий код ответа веб-сервера.
en: The column that contains the web server response code was added in the output data set - "Additional data".

source: В данном случае дублирующимися строками считаются строки с точным совпадением сравниваемых полей.
en: In this case, the doubled rows are considered to be the rows with exact match of the compared fields.

source: В имени пользователей и общих папок разрешено использовать символы точка, минус и пробел, также имена могут начинаться с цифры.
en: It is allowed to use such characters as point, minus and space in the user name and shared folders, such names can also start from a digit.

source: В интеграторе отсутствует возможность построения отказоустойчивого кластера.
en: It is not possible to build the fail-safe cluster in the integrator.

source: В качестве среды исполнения используется CPython, а работа с компонентом Python в сценарии идентична работе с компонентом JavaScript.
en: CPython is used as the runtime environment, and the Python component operation in the workflow is identical to the JavaScript component operation.

source: В компоненте Фильтр строк при выборе условия фильтрации «В списке / Вне списка» добавлена возможность копирования и вставки данных через буфер обмена.
en: It became possible to copy and paste data via clipboard in Row filter component when selecting "listed / not listed" filtering criterion.

source: В контекстное меню менеджера файлового хранилища был добавлен пункт «Копировать полный путь».
en: "Copy full path" item was added to the context menu of the file storage manager.

source: В логистической регрессии исправлен расчет показателей модели, в частности: Хи-квадрат, -2 Логарифма функции правдоподобия, Псевдо-R^2 Макфаддена и Псевдо-R^2 Макфаддена (скорр.), -2 Логарифма функции правдоподобия нулевой модели.
en: Calculation of the model parameters was corrected in the logistic regression: Chi-square, -2 Log-likelihood, McFadden pseudo-R^2 and McFadden pseudo-R^2 (adj.), -2 Log-likelihood of null model.

source: В мастера настройки обработчиков, алгоритмы которых используют генерацию псевдослучайных чисел, добавлена возможность установить Random Seed.
en: Now it is possible to install Random Seed in the wizard of the handlers algorithms of which use generation of pseudorandom numbers.

source: В мастерах настройки соответствия полей и переменных добавлена возможность создавать поля или переменные на основе уже существующих.
en: It became possible to create fields or variables based on the existing ones in the fields and variables mapping wizards.

source: В мастерах подключения к Хранилищу данных на СУБД MS SQL и Oracle добавлена возможность указать имя схемы, в которой находятся метаданные и данные ХД.
en: In wizards of connection to the Data Warehouse on MS SQL and Oracle DBMS it became possible to specify the name of the schema in which metadata and DW data are located.

source: В мастере Импорта из ХД добавлена возможность указать некоторые параметры фильтрации с помощью управляющих переменных.
en: It became possible to specify some filtration parameters using control variables in the Import from Data Warehouse Wizard.

source: В мастере настройки Подмодели добавлен флаг необязательности портов.
en: Port optionality checkbox was added in the Supernode wizard.

source: В мастере настройки больше недоступна настройка «Разрешить невалидные имена», но осталась настройка «Уникальные значения как имена полей».
en: "Allow invalid names" setting is not available in the wizard, whereas "Unique values as field names" setting is preserved.

source: В мастере настройки подключения REST-сервис изменилось значение по умолчанию для параметра «Допустимый Content-Type ответа».
en: The default value of "Allowable Content-type of response" parameter was changed in the REST service connection wizard.

source: В мастере настройки подключения добавлена проверка строки подключения и обязательных параметров.
en: Check of connection string and required parameters was added to the connection wizard.

source: В настройках администрирования добавлена стандартная группа пользователей «Все».
en: The standard "All" user group was added to the administration settings.

source: В некоторых случаях были проблемы при дальнейшей обработке данных (#5903).
en: In some cases there were problems during the further data processing (#5903).

source: В некоторых случаях внутри сценария могло потребоваться значение идентификатора запроса, полученного при выполнении узла сценария через Loginom Integrator.
en: In some cases, the identifier value of the request received when executing the workflow node by means of Loginom Integrator could be required in the workflow.

source: В некоторых случаях до 5 раз быстрее.
en: In some cases it occurred up to 5 times faster.

source: В некоторых случаях после конвертации пакетов, созданных в более ранних версиях Loginom (добавления производных компонентов по опубликованным узлам при конвертации), а также в системах с высокой нагрузкой могли возникать множественные ошибки при логировании во время отложенного обновления конфигурации производных компонентов.
en: In some cases after conversion of the packages created in the earlier Loginom versions (addition of the derived components for published nodes during conversion), and in the systems with high load many errors could occur when logging during the delayed updating of the derived components configuration.

source: В некоторых случаях после просмотра данных ошибка не появлялась, но наблюдалось значительное замедление работы Loginom Studio и требовался перезапуск браузера.
en: In some cases the error didn't occur after data view but significant slowdown of Loginom Studio operation was observerd, and it was required to restart the browser.

source: В некоторых сценариях (содержащих большое количество узлов JavaSсript) может увеличиться объем памяти, занятый приложением (#9469).
en: Memory size used by the application can be increased in some workflows (that contain many JavaScript nodes) (#9469).

source: В новой версии библиотеки были исправлены ошибки, из-за которых в некоторых случаях сбивался масштаб пузырьковой диаграммы (#9222).
en: The errors that caused in some cases incorrect scale settings of the bubble chart were corrected(#9222).

source: В новой версии платформы его функционал был значительно улучшен:
en: Its functionality was significantly improved in the new platform version:

source: В новой версии платформы появилась возможность публикации веб-сервисов в редакции Team с помощью Loginom Integrator. Он несколько отличается от интегратора для редакций Standard и Enterprise:
en: It became possible to publish web services in the Team edition using Loginom Integrator in the new platform version. It somewhat differs from the integrator for the Standard and Enterprise editions:

source: В новой версии платформы появилась возможность указать нужную локаль для сохраняемого пакета.
en: It became possible to show the required locale for the saved package in the new platform version.

source: В новой версии платформы при подключении любого пакета в меню «производные компоненты» отображаются все компоненты, доступные для переиспользования, причем как для обычного выполнения, так и для редактирования.
en: All components available for the reuse both for the common execution, and for editing are displayed in the "derived components" menu in the new platform version when connecting any package.

source: В обновление вошло большое количество изменений и новых возможностей. Ниже приведен список наиболее важных, на наш взгляд, изменений:
en: Many changes and new options were introduced into the new updated version. In our opinion, the most important changes are listed below:

source: В обновление вошло большое количество улучшений и новых возможностей, направленных на удобство использования платформы.
en: Many improvements and new options aimed at the platform use convenience were introduced.

source: В обновленном мастере настройки работа с SQL-запросами стала значительно удобнее:
en: It became much more comfortable to work with SQL queries in the updated wizard:

source: В обработчик JavaScript добавлен File Storage API, позволяющий безопасно и без настройки прав выполнять все файловые операции:
en: Now JavaScript handler includes File Storage API that enables to execute all file operations without rights setup and in a safe manner:

source: В обработчике Корреляционный анализ при расчете экстремума взаимокорреляционной функции для пользователя добавлен вывод номера лага (величины смещения).
en: Functionality that enabled to show lag number (offset value) was added for a user to the Correlation Analysis handler when calculating extremum of cross-correlation function.

source: В обработчике Параметры полей добавлена возможность исключать столбцы из дальнейшей обработки.
en: Now it is possible to exclude the columns from the further processing in Field features handler.

source: В обработчике Подмодель появился необязательный входной табличный порт, что делает проектирование сценариев более гибким.
en: Optional input table port appeared in Supernode handler. It enables to make design of workflows more flexible.

source: В обработчике Сортировка добавлена опция кэширования данных.
en: Data caching option was added in Sorting handler.

source: В обработчике Заполнение пропусков иначе работает метод «Заполнение случайными значениями».
en: "Imputation with random values" method works differently in Imputation handler.

source: В обработчике Заполнение пропусков добавлена возможность заменять пропущенные числовые значения на 0, а также оптимизирована работа обработчика, а из списка допустимых методов для Логического типа данных убран вариант Не задано.
en: It became possible to replace null numerical values with 0 in the Imputation handler, and the handler operation was optimised, Unspecified option was removed from the list of the methods allowable for the Logistic data type.

source: В обработчике Фильтр строк добавлены варианты фильтрации по диапазону дат «первый», «последний» с использованием даты из набора данных.
en: Filtration options by the "first", "last" date ranges using the dates from the data set were added to the Row Filter handler.

source: В обычных условиях применения продукта ошибка не воспроизводилась.
en: Under normal conditions of the product use the error was not reproduced.

source: В окне «Свойства ссылки на пакет» добавлена также возможность менять путь к пакету, если ссылка разорвана.
en: It also became possible to change the path to the package in "Properties of reference to package" window if the reference had been broken.

source: В окне быстрого просмотра удалена нижняя панель с единственной кнопкой «Закрыть», вместо этого окно может быть закрыто кликом по любому месту вне окна быстрого просмотра или по нажатию на «×» (кнопку закрытия окна).
en: The lower bar with the only "Close" button was removed in the quick view window. Instead, the window can be closed by clicking on any space outside the quick view window or by pressing «×» (window close button).

source: В ответ на такой запрос можно было получить ошибку "Bad Request" (#9850).
en: "Bad Request" error could occur in response to such request (#9850).

source: В ответное json-сообщение Интегратора не записываются опциональные элементы, у которых не задано значение.
en: The optional elements for which no value is specified are not recorded in the response json message of Integrator.

source: В открывшемся окне доступны две опции на выбор: «Выполнение узла и Цикл» и «Производные узлы».
en: It is possible to select two available options in the opened window: "Node Execution and Loop" and "Derived nodes".

source: В открытом после ошибки мастере настройки, в поле SQL-запроса, отображалось имя таблицы вместо текста запроса, а дальнейшие действия пользователя в мастере приводили к появлению различных ошибок.
en: The table name was displayed instead of the query text in the SQL query field in the wizard opened after an error, and further action performed in the wizard by the user caused different errors.

source: В очередном обновлении уделили внимание удобству использования платформы, оптимизировали работу со сложными сценариями, а также исправили найденные ошибки.
en: In this update, special attention was paid to the platform usability, performance improvements related to complex workflows operation were made, and some fixes were performed.

source: В пакетах, созданных до версии 6.5, имеющих подключение к Хранилищу данных на MS SQL через встроенный клиент, при активации подключения будет выдана ошибка "Required provider is not installed".
en: On activation of connection "Required provider is not installed" error will be displayed for the packages created up to 6.5 version that are connected with Data storage on MS SQL via built-in client.

source: В панели Администрирование добавлена возможность настройки прав на публикацию пакетов у каждого пользователя.
en: It became possible to configure packages publishing rights of each user on the Administration panel.

source: В панели навигации добавлен новый узел «Веб-сервисы», при активации которого открывается страница настройки публикации пакетов.
en: The new node ("Web services") was added on the navigation panel. Its activation enables to open the packages publication configuration page.

source: В прежнем исполнении в режиме SQL-запроса было недостаточно места для текста запроса, а также невозможно было тут же увидеть переменные и воспользоваться ими.
en: There was not enough space for the request text in the SQL query mode in the previous version, and it was also impossible to see variables and use them.

source: В процессе коллективной работы или при выполнении сценариев со сложными зависимостями нередко возникала ситуация, что сервер предупреждал о том, что необходимый пакет уже используется.
en: In the teamwork process or when executing the workflows with complex dependences, it frequently happened that the server notified that the required package was already used.

source: В рамках каждого пакета компоненты сортируются в алфавитном порядке.
en: The components are sorted in alphabetic order in each package.

source: В редакторах «Дата/время» при вводе данных с клавиатуры можно указать только дату без времени.
en: When entering data from the keyboard in "Date/time" editors, it is possible to specify only date without time.

source: В редакциях под Windows возможен запуск как в рамках процесса Loginom, так и в отдельном процессе, а под Linux поддерживается только вариант работы в отдельном процессе.
en: Start both within the Loginom process and in a separate process is available in Windows editions, and operation in Linux is supported only in a separate process.

source: В результате доработки стороннего модуля ошибку удалось устранить (#7178, #8877, #8897).
en: The error was corrected after improvement of the third-party module (#7178, #8877, #8897).

source: В результате импорт из текстового файла стал работать в 1.5 раза быстрее.
en: In the result, import from text file became by 1.5 times faster.

source: В результате ошибки в окне «Выбор базового компонента» иногда отображалось, что список компонентов пуст.
en: In the result of the error in "Base component selection" window it was sometimes displayed that the list was empty.

source: В результате появилась поддержка:
en: The following support has been provided:

source: В результате строковое значение разбивалось на разные строки без какой-либо информации о том, что оно должно быть одной строкой.
en: In the result, the string value was broken up into different strings without any information on the fact that it was to be one string.

source: В результате упрощается поиск проблемных узлов (#8952).
en: In the result, it becomes easier to search for the problem nodes. (#8952).

source: В результате чего активация узлов Выполнение/Цикл завершалась ошибкой «Выполнение узла: Порт "Выходные переменные" не настроен».
en: As a result, activation of Execution/Loop nodes was terminated with the following error: "Node execution: "Output variables" port is not configured".

source: В результате, даже при выборе конкретного значения из списка, ни одна строка могла не соответствовать условию (#5489).
en: Consequently, even when selecting the defined value from the list, none of the rows could conform to the condition (#5489).

source: В результате, если запрос содержал переменные в качестве параметра или макроподстановки, пользователь получал сообщение об ошибке: "Ошибка открытия SQL: SELECT from ... near "from": syntax error" (#9353).
en: In the result, if the request contained variables as parameter or macro lookup, a user received the following error message: "Error when opening SQL: SELECT from ... near "from": syntax error" (#9353).

source: В свойствах пакета появилась опция «Сравнивать строковые уникальные значения бинарно».
en: "Compare string unique values in a binary way" option appeared in the package properties.

source: В связи с внесенными изменениями стоит обратить внимание на следующее:
en: It is required to pay special attention to the following facts connected with the introduced changes:

source: В связи с тем, что компонент выполняет код Python на сервере, на его использование накладывается ряд ограничений:
en: Taking into consideration the fact that the component executes the Python code on server, there are several restrictions concerning its use:

source: В связи с этим Сэмплинг и Разбиение на множества могут генерировать другое разбиение.
en: In this regard, Sampling and Partitioning can generate another partitioning.

source: В связи с этим рекомендуется использовать для выполнения ранее отлаженный код Python.
en: In this context, it is recommended to use the Python code debugged in advance.

source: В связи с этим, администратор должен явно предоставить возможность использования на сервере компонента Python.
en: In this context, the administrator must provide the definite possibility to use the Python component on server.

source: В секции log файла конфигурации добавлен опциональный элемент console, в котором настраивается уровень логирования в консоль.
en: In log section of the configuration file optional console element was added. The level of logging to the console is configured in it.

source: В серверных редакциях на странице настройки пакетов добавлена возможность настроить периодическое автоматическое резервное копирование всех открытых пакетов.
en: It became possible to set the periodic auto backing up of all opened packages in the server editions on the package configuration page.

source: В случае с xlsx форматом происходит скачивание всего файла в память, поэтому стоит обращать внимание на размер таких файлов.
en: When it comes to xlsx format, the whole file is downloaded to memory that is why it is required to pay attention to size of such files.

source: В списке оставались несуществующие входные столбцы, а попытка создать на их основе выходные столбцы приводила к ошибке (#8457).
en: Nonexistent input columns were left in the list, and attempt to create the output columns based on them caused an error (#8457).

source: В строках, состоящих только из пробельных символов, каждый пробел заменен на пару символов ˽ (выступ + пробел) и они также отображаются специальным стилем (#9589).
en: Each space in the strings that consisted of only white spaces was replaced to the combination of characters ˽ (undent + space), and they were also displayed using the special style (#9589).

source: В сценариях, подготовленных в более ранних версиях Loginom, может измениться порядок сортировки строк.
en: The order of row sorting can be changed in the workflows prepared in the earlier Loginom versions.

source: В таблице добавлена возможность группового редактирования формата данных.
en: Group editing of the data format became possible in the table.

source: В тексте сообщения содержится GUID исходного узла, а в некоторых случаях также выводится метка узла (#9259, #9315).
en: Message text contains GUID of source node and in some cases node caption is displayed (#9259, #9315).

source: В текущем сценарии на этих же данных невозможно было обучить и другие узлы Ассоциативные правила.
en: It was impossible to train other Association rules nodes in the current workflow using the same data.

source: В том числе, сообщение будет получено, если в самом пакете нет таких узлов, но они есть в одном из подключенных пакетов.
en: This message will be also received if there are no such nodes in the package but they are available in one of the connected packages.

source: В файле конфигурации добавлен элемент <journald level="Off" maxEntrySize="65536"/>, который настраивает логирование в journald под Linux.
en: <journald level="Off" maxEntrySize="65536"/> element was added to the configuration file. It configures logging in journald for Linux.

source: В частности, в это сообщение теперь не записываются элементы вида "Container": null для отсутствующих контейнеров в древовидной структуре данных (#9793).
en: In particular, now "Container": null elements are not recorded in this message for the nonavailable containers in the tree-like data structure (#9793).

source: В этой версии добавили поддержку временных таблиц в импорте из 1С, улучшили работу Loginom Integrator, повысили информативность сообщений об ошибках в узлах Выполнение узла и Узел-ссылка.
en: Support of time tables in import from 1C was added in this version, Loginom Integrator operation was improved, error messages comprehension was improved in Execution Node and Reference Node nodes.

source: В этой версии исправлено несколько ошибок, выявленных при тестировании возможностей, добавленных в версии 6.4.0.
en: Several errors detected when testing the features added in version 6.4.0 were corrected in this version.

source: В этой ситуации нижняя граница второго класса не должна изменяться и должна совпадать с верхней границей предыдущего класса.
en: In this situation the lower bound of the second class must not change and it must match the upper bound of the previous class.

source: В этом обновлении доработали файловое хранилище, оптимизировали использование процессора и оперативной памяти в многопоточном режиме, а также исправили обнаруженные ошибки.
en: In this update, file storage was modified, performance improvements related to operation of processor and memory in the multithreading mode were made, and some fixes were performed.

source: В этом обновлении исправлено потребление оперативной памяти на сервере при использовании узла JavaScript в цикле, ускорен повторный запуск сценария при работе через Loginom Integrator или при Пакетном выполнении, а также исправлен ряд ошибок, возникавших при работе с базами данных.
en: In this update, the memory consumption on server when using JavaScript node in the loop was corrected, the repeated workflow start when using Loginom Integrator or Batch Processing became faster and some errors occurring when using databases were corrected.

source: Важно, чтобы этот процесс был максимально комфортным для специалиста, отвечал всем его запросам.
en: It is necessary to make this process comfortable for a specialist to the greatest possible extent. It must meet all his requirements.
